Revit 2027 API
Workset Properties
The Workset type exposes the following members.
Properties
Name | Description
Id |  Id of the workset.
(Inherited from WorksetPreview)
IsDefaultWorkset |  Whether the workset is the default one.
(Inherited from WorksetPreview)
IsEditable |  Whether the workset is editable.
IsOpen |  Whether the workset is open (rather than closed).
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from WorksetPreview)
IsVisibleByDefault |  Whether the workset is visible by default.
Kind |  Kind of the workset.
Name |  Name of the workset.
(Inherited from WorksetPreview)
Owner |  User name of the workset.
(Inherited from WorksetPreview)
UniqueId |  UniqueId of the workset.
(Inherited from WorksetPreview)
Top
See Also
Reference
Workset Class
Autodesk.Revit.DB Namespace